In [63]:
import pandas as pd
import numpy as np

from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

In [64]:
df = pd.read_csv('Titanic-Dataset.csv')[['Age', 'Pclass', 'SibSp', 'Parch', 'Survived']]

In [65]:
df.head()  

# here, we have 4 input columns and 1 output column(i.e, 'Survived').

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [66]:
# as we know, here in 'Age', there is some missing data, so we drop it

df.dropna(inplace=True)

In [67]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [68]:
# so, we now separate our input and output columns

X = df.iloc[:,0:4]
y = df.iloc[:, -1]

In [69]:
X.head()

    Age  Pclass  SibSp  Parch
0  22.0       3      1      0
1  38.0       1      1      0
2  26.0       3      0      0
3  35.0       1      1      0
4  35.0       3      0      0

In [70]:
# checking for accuracy using cross_val_score

np.mean(cross_val_score(LogisticRegression(), X,y,scoring='accuracy', cv=20))

0.6933333333333332

<h2> Applying Feature Construction </h2>

In [71]:
# now, I just want to  make a new column by adding 'SibSp' and 'Parch' to 'Family_size'

X['Family_size'] = X['SibSp'] + X['Parch'] + 1  # we add '1' here to also include that person in this 
X.head()

    Age  Pclass  SibSp  Parch  Family_size
0  22.0       3      1      0            2
1  38.0       1      1      0            2
2  26.0       3      0      0            1
3  35.0       1      1      0            2
4  35.0       3      0      0            1

In [72]:
# now, I just make a function in which when you provide 'Family_size' then it returns you a value conditionally

def myfunc(num):
    if num==1:
        # alone 
        return 0
    elif num > 1 and num <=4:
        # small family
        return 1
    else:
         #large family
        return 2

In [73]:
myfunc(4)

1

In [74]:
# Add these new column to the main column

X['Family_type'] = X['Family_size'].apply(myfunc)

In [75]:
X.head()

    Age  Pclass  SibSp  Parch  Family_size  Family_type
0  22.0       3      1      0            2            1
1  38.0       1      1      0            2            1
2  26.0       3      0      0            1            0
3  35.0       1      1      0            2            1
4  35.0       3      0      0            1            0

In [76]:
X.drop(columns=['SibSp', 'Parch', 'Family_size'], inplace=True)

In [77]:
X.head()

    Age  Pclass  Family_type
0  22.0       3            1
1  38.0       1            1
2  26.0       3            0
3  35.0       1            1
4  35.0       3            0

In [78]:
# Again, apply cross_val_score to check accuracy after applying "Feature_Construction"

np.mean(cross_val_score(LogisticRegression(), X,y,scoring='accuracy', cv=20))

# so it's clear, After implementing "Feature Construction", Accuracy is increased little

0.7003174603174602

<h2> Feature Splitting</h2>

In [79]:
df = pd.read_csv('Titanic-Dataset.csv')

In [80]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [81]:
df['Name']

# So, it is written in the order of (lastName, surName fisrtName)

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [82]:
# But, we just want that Surname(salutation) from here, so usko 'Name' column se bahar nikalna pdega

# df['Name'].str.split(', ', expand=True)  --> so, this gives both comma ke baad wali chiz + comma ke phli waali chiz
# df['Name'].str.split(', ', expand=True)[1]  --> this is for comma ke baad wali chiz k liye (b/c sirName hmara whi pe hia, and hme usse find krna hai)


df['Name'].str.split(', ', expand=True)[1].str.split('.', expand=True) #--> we apply this and said that ki 'hme dot ke upr split krke dikhao'

# now, It is divided into part by part, So, we can easily extract whatever we want from here

        0                                       1     2
0      Mr                             Owen Harris  None
1     Mrs   John Bradley (Florence Briggs Thayer)  None
2    Miss                                   Laina  None
3     Mrs           Jacques Heath (Lily May Peel)  None
4      Mr                           William Henry  None
..    ...                                     ...   ...
886   Rev                                  Juozas  None
887  Miss                          Margaret Edith  None
888  Miss                Catherine Helen "Carrie"  None
889    Mr                             Karl Howell  None
890    Mr                                 Patrick  None

[891 rows x 3 columns]

In [83]:
df['Title'] = df['Name'].str.split(', ', expand=True)[1].str.split('.', expand=True)[0] 

# Using this, I find all Surname(Salutation) from the 'Name' column

In [84]:
df[['Title', 'Name']].head()

  Title                                               Name
0    Mr                            Braund, Mr. Owen Harris
1   Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2  Miss                             Heikkinen, Miss. Laina
3   Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4    Mr                           Allen, Mr. William Henry

In [89]:
# (df.groupby('Title').mean()['Survived']).sort_values(ascending=False) --> it gives an error, so use it 

(df.groupby('Title')['Survived'].mean()).sort_values(ascending=False)

# so here, you can check how the 'Title' related to 'Survived' column

Title
the Countess    1.000000
Mlle            1.000000
Sir             1.000000
Ms              1.000000
Lady            1.000000
Mme             1.000000
Mrs             0.792000
Miss            0.697802
Master          0.575000
Col             0.500000
Major           0.500000
Dr              0.428571
Mr              0.156673
Jonkheer        0.000000
Rev             0.000000
Don             0.000000
Capt            0.000000
Name: Survived, dtype: float64

In [90]:
# we again construct a new column 

df['Is_Married'] = 0
df['Is_Married'].loc[df['Title'] == 'Mrs'] = 1

C:\Users\munna\AppData\Local\Temp\ipykernel_7600\1278852055.py:4: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Is_Married'].loc[df['Title'] == 'Mrs'] = 1
C:\Users\munna\AppData\Local\Temp\ipykernel_7600\1278852055.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Is_Married'].loc[df['Title'] == 'Mrs'] = 1

In [93]:
df['Is_Married']

0      0
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    0
889    0
890    0
Name: Is_Married, Length: 891, dtype: int64

In [ ]:
# you can also explore or relate any column to others to get a new data.........